tests/load.yml
config:
  target: 'http://localhost:3000'
  plugins:
    expect: {}
  phases:
    - name: Calentamiento
      duration: 15
      arrivalRate: 5
    - name: Carga sostenida
      duration: 60
      arrivalRate: 30
    - name: Pico de carga
      duration: 15
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: 'application/json'

# Nota: Para deshabilitar rate limiting durante el test (recomendado), arrancar
# el servidor con NODE_ENV=test. El CI lo hace automáticamente (load.yml).
# Localmente: NODE_ENV=test npm run dev
# En NODE_ENV=test los limitadores son no-op (src/middleware/rateLimiter.ts).
# Si el servidor corre en modo normal, el globalLimiter (300/15min) generará
# respuestas 429 una vez superado el umbral — también se acepta como válido.

scenarios:
  - name: Health check
    weight: 40
    flow:
      - get:
          url: '/api/v1/health'
          expect:
            - statusCode:
                - 200
                - 429

  - name: Endpoints de información pública
    weight: 25
    flow:
      - get:
          url: '/api/v1/dpop/info'
          expect:
            - statusCode:
                - 200
                - 429
      - get:
          url: '/api/v1/ratelimit/info'
          expect:
            - statusCode:
                - 200
                - 429
      - get:
          url: '/api/v1/rbac/info'
          expect:
            - statusCode:
                - 200
                - 429

  - name: Endpoints protegidos sin auth — deben rechazar con 401
    weight: 25
    flow:
      - get:
          url: '/api/v1/user/me'
          expect:
            - statusCode:
                - 401
                - 429
      - get:
          url: '/api/v1/mfa/status'
          expect:
            - statusCode:
                - 401
                - 429
      - get:
          url: '/api/v1/admin/users'
          expect:
            - statusCode:
                - 401
                - 429

  - name: Login con credenciales incorrectas — debe rechazar con 401
    weight: 10
    flow:
      - post:
          url: '/api/v1/auth/login'
          json:
            email: 'noexiste@loadtest.com'
            password: 'WrongPassword123'
          expect:
            - statusCode:
                - 401
                - 429